Linux/LinuxKernel/CreateDestroyProcess.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>进程的创建与销毁</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="进程的创建与销毁"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-10-10 16:41:40 CST"/>
<meta name="author" content="visaya fan"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="H" href="../../index.html#linuxkernel"> HOME </a>
</div>


<div id="content">
<h1 class="title">进程的创建与销毁</h1>


<script type="text/javascript" src="https://ajax.googleapis.com/ajax/libs/jquery/1.7.1/jquery.min.js"> </script>
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/vf.css" />
<script src="../../Layout/JS/bootstrap_old.js"></script>
<script src="../../Layout/JS/disqus-comment.js"></script>



<div id="table-of-contents">
<h2>TOC</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 clone fork vfork</a></li>
<li><a href="#sec-2">2 do_fork</a></li>
<li><a href="#sec-3">3 copy_process</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> clone fork vfork</h2>
<div class="outline-text-2" id="text-1">

<p>  为了提高进程创建的效率，Linux内核采用了3种技术：<br/>
</p><ul>
<li>轻量级进程（Light Weight Process）：子进程和父进程共享地址空间，从而减少复制开销。利用 <code>clone</code> 函数实现。下面的fork和vfork都是通过调用clone通过传参不同达到不同效果。<br/>
</li>
<li>写时拷贝（Copy On Write）：即子进程与父进程共享地址空间，但当其中一个进程要写时必须由内核把将被修改的页拷贝到一个新的页中并在此页中写。 <code>fork</code> 便是用此方法来创建新进程。 <b>此时父进程与子进程是并行执行的</b> 这是与vfork最大的区别之1。<br/>
</li>
<li>子进程和父进程共享地址空间，为防止父进程修改地址空间，将父进程阻塞直到子进程被释放。 <code>vfork</code> 便是用此方法来创建新进程。 <b>子进程修改内存区域对父进程是可见的</b> 这是与fork最大的区别之2<br/>
</li>
</ul>


<p><br/>
<pre class="src src-c"><span class="linenr"> 1:  </span><span style="color: #228b22;">int</span> <span style="color: #0000ff;">clone</span>(<span style="color: #228b22;">int</span> (*<span style="color: #a0522d;">fn</span>)(<span style="color: #228b22;">void</span> *), <span style="color: #228b22;">void</span> *<span style="color: #a0522d;">child_stack</span>,
<span class="linenr"> 2:  </span>                 <span style="color: #228b22;">int</span> <span style="color: #a0522d;">flags</span>, <span style="color: #228b22;">void</span> *<span style="color: #a0522d;">arg</span>, 
<span class="linenr"> 3:  </span>                 <span style="color: #b22222;">/* </span><span style="color: #b22222;">pid_t *ptid, struct user_desc *tls, pid_t *ctid </span><span style="color: #b22222;">*/</span> );
<span class="linenr"> 4:  </span><span style="color: #b22222;">/*</span>
<span class="linenr"> 5:  </span><span style="color: #b22222;"> * kernel 2.6.11 &#20043;&#21518;&#30340;&#20869;&#26680;&#29256;&#26412;&#20013;&#24341;&#20837;&#20102;&#35768;&#22810;&#20854;&#23427;&#30340;&#26631;&#24535;&#65292;&#20363;&#22914;:</span>
<span class="linenr"> 6:  </span><span style="color: #b22222;"> * CLONE_NEWNET&#22312;&#19968;&#26032;&#30340;&#32593;&#32476;namespce&#20013;&#21019;&#24314;&#23376;&#36827;&#31243;</span>
<span class="linenr"> 7:  </span><span style="color: #b22222;"> * CLONE_NEWPID&#22312;&#19968;&#26032;&#30340;PID namespace&#20013;&#21019;&#24314;&#19968;&#20010;&#26032;&#30340;&#36827;&#31243;</span>
<span class="linenr"> 8:  </span><span style="color: #b22222;"> * CLONE_NEWIPC&#22312;&#19968;&#26032;&#30340;IPC namespace&#20013;&#21019;&#24314;&#19968;&#20010;&#26032;&#30340;&#36827;&#31243;</span>
<span class="linenr"> 9:  </span><span style="color: #b22222;"> * CLONE_IO&#20849;&#20139;IO</span>
<span class="linenr">10:  </span><span style="color: #b22222;"> </span><span style="color: #b22222;">*/</span>
<span class="linenr">11:  </span><span style="color: #7a378b;">#define</span> <span style="color: #a0522d;">CSIGNAL</span>     0x000000ff             <span style="color: #b22222;">/* </span><span style="color: #b22222;">&#36864;&#20986;&#26102;&#26631;&#24535;signal mask to be sent at exit </span><span style="color: #b22222;">*/</span>
<span class="linenr">12:  </span><span style="color: #7a378b;">#define</span> <span style="color: #a0522d;">CLONE_VM</span>    0x00000100             <span style="color: #b22222;">/* </span><span style="color: #b22222;">&#20849;&#20139;&#22320;&#22336;&#31354;&#38388;set if VM shared between processes </span><span style="color: #b22222;">*/</span>
<span class="linenr">13:  </span><span style="color: #7a378b;">#define</span> <span style="color: #a0522d;">CLONE_FS</span>    0x00000200             <span style="color: #b22222;">/* </span><span style="color: #b22222;">&#20849;&#20139;&#25991;&#20214;&#31995;&#32479;set if fs info shared between processes </span><span style="color: #b22222;">*/</span>
<span class="linenr">14:  </span><span style="color: #7a378b;">#define</span> <span style="color: #a0522d;">CLONE_FILES</span> 0x00000400             <span style="color: #b22222;">/* </span><span style="color: #b22222;">&#20849;&#20139;&#25171;&#24320;&#25991;&#20214;set if open files shared between processes </span><span style="color: #b22222;">*/</span>
<span class="linenr">15:  </span><span style="color: #7a378b;">#define</span> <span style="color: #a0522d;">CLONE_SIGHAND</span>   0x00000800         <span style="color: #b22222;">/* </span><span style="color: #b22222;">&#20849;&#20139;&#20449;&#24687;&#22788;&#29702;&#22120;&#21644;&#38459;&#22622;&#20449;&#21495;&#65311;,&#22914;&#26524;&#27492;&#20301;&#34987;&#32622;&#65292;&#21017;CLONE_VM&#24517;&#39035;&#20063;&#34987;&#32622; set if signal handlers and blocked signals shared </span><span style="color: #b22222;">*/</span>
<span class="linenr">16:  </span><span style="color: #7a378b;">#define</span> <span style="color: #a0522d;">CLONE_PTRACE</span>    0x00002000         <span style="color: #b22222;">/* </span><span style="color: #b22222;">&#29238;&#36827;&#31243;&#34987;&#36319;&#36394;&#26102;&#23376;&#36827;&#31243;&#20063;&#34987;&#36319;&#36394;set if we want to let tracing continue on the child too </span><span style="color: #b22222;">*/</span>
<span class="linenr">17:  </span><span style="color: #7a378b;">#define</span> <span style="color: #a0522d;">CLONE_VFORK</span> 0x00004000             <span style="color: #b22222;">/* </span><span style="color: #b22222;">&#29238;&#36827;&#31243;&#34987;&#25346;&#36215;&#30452;&#21040;&#23376;&#36827;&#31243;&#37322;&#25918;&#34394;&#25311;&#20869;&#23384; set if the parent wants the child to wake it up on mm_release </span><span style="color: #b22222;">*/</span>
<span class="linenr">18:  </span><span style="color: #7a378b;">#define</span> <span style="color: #a0522d;">CLONE_PARENT</span>    0x00008000         <span style="color: #b22222;">/* </span><span style="color: #b22222;">&#20849;&#20139;&#29238;&#36827;&#31243;&#65292;&#21363;&#25913;&#21464;&#29238;&#23376;&#20851;&#31995;&#20026;&#20804;&#24351;&#20851;&#31995;set if we want to have the same parent as the cloner </span><span style="color: #b22222;">*/</span>
<span class="linenr">19:  </span><span style="color: #7a378b;">#define</span> <span style="color: #a0522d;">CLONE_THREAD</span>    0x00010000         <span style="color: #b22222;">/* </span><span style="color: #b22222;">&#23376;&#36827;&#31243;&#21152;&#20837;&#29238;&#36827;&#31243;&#30340;&#32447;&#31243;&#32452;&#65292;&#35774;&#32622;&#23376;&#36827;&#31243;&#30340;tgid&#21644;group_leader, Same thread group? </span><span style="color: #b22222;">*/</span>
<span class="linenr">20:  </span><span style="color: #7a378b;">#define</span> <span style="color: #a0522d;">CLONE_NEWNS</span> 0x00020000             <span style="color: #b22222;">/* </span><span style="color: #b22222;">&#22312;&#26032;&#30340;namespce&#21551;&#21160;&#23376;&#36827;&#31243;&#65311;New namespace group? </span><span style="color: #b22222;">*/</span>
<span class="linenr">21:  </span><span style="color: #7a378b;">#define</span> <span style="color: #a0522d;">CLONE_SYSVSEM</span>   0x00040000         <span style="color: #b22222;">/* </span><span style="color: #b22222;">share system V SEM_UNDO semantics </span><span style="color: #b22222;">*/</span>
<span class="linenr">22:  </span><span style="color: #7a378b;">#define</span> <span style="color: #a0522d;">CLONE_SETTLS</span>    0x00080000         <span style="color: #b22222;">/* </span><span style="color: #b22222;">&#23376;&#36827;&#31243;&#21019;&#24314;&#26032;&#30340;thread local segment&#65311;&#65311;&#65311;create a new TLS for the child </span><span style="color: #b22222;">*/</span>
<span class="linenr">23:  </span><span style="color: #7a378b;">#define</span> <span style="color: #a0522d;">CLONE_PARENT_SETTID</span> 0x00100000     <span style="color: #b22222;">/* </span><span style="color: #b22222;">&#35774;&#32622;&#21442;&#25968;&#20013;&#30340;pid&#20026;&#23376;&#36827;&#31243;&#30340;&#36827;&#31243;&#21495; set the TID in the parent </span><span style="color: #b22222;">*/</span>
<span class="linenr">24:  </span><span style="color: #7a378b;">#define</span> <span style="color: #a0522d;">CLONE_CHILD_CLEARTID</span>    0x00200000 <span style="color: #b22222;">/* </span><span style="color: #b22222;">&#28165;&#38500;&#23376;&#36827;&#31243;&#30340;tid&#65292; clear the TID in the child </span><span style="color: #b22222;">*/</span>
<span class="linenr">25:  </span><span style="color: #7a378b;">#define</span> <span style="color: #a0522d;">CLONE_DETACHED</span>      0x00400000     <span style="color: #b22222;">/* </span><span style="color: #b22222;">&#20445;&#30041;Unused, ignored </span><span style="color: #b22222;">*/</span>
<span class="linenr">26:  </span><span style="color: #7a378b;">#define</span> <span style="color: #a0522d;">CLONE_UNTRACED</span>      0x00800000 <span style="color: #b22222;">/* </span><span style="color: #b22222;">&#23376;&#36827;&#31243;&#19981;&#35201;&#34987;&#36319;&#36394;set if the tracing process can't force CLONE_PTRACE on this clone </span><span style="color: #b22222;">*/</span>
<span class="linenr">27:  </span><span style="color: #7a378b;">#define</span> <span style="color: #a0522d;">CLONE_CHILD_SETTID</span>  0x01000000 <span style="color: #b22222;">/* </span><span style="color: #b22222;">&#35774;&#32622;&#23376;&#36827;&#31243;&#30340;tid&#21464;&#37327;&#20026;&#23376;&#36827;&#31243;&#30340;ID&#65292; set the TID in the child </span><span style="color: #b22222;">*/</span>
<span class="linenr">28:  </span><span style="color: #7a378b;">#define</span> <span style="color: #a0522d;">CLONE_STOPPED</span>       0x02000000 <span style="color: #b22222;">/* </span><span style="color: #b22222;">&#23376;&#36827;&#31243;&#21021;&#22987;&#29366;&#24577;&#20026;TASK_STOPPED, Start in stopped state </span><span style="color: #b22222;">*/</span>
</pre>

</p></div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> do_fork</h2>
<div class="outline-text-2" id="text-2">

<p>  1中的函数都调用了do_fork。<br/>
  函数执行过程：<br/>
</p><ul>
<li>从pidmap_array中获取一个进程ID，分配失败则出错返回<br/>
</li>
<li>检查当前正在运行的进程是否正在被跟踪<br/>
<ul>
<li>如果是则检查参数中的flag是否被设置了CLONE_UNTRACE<br/>
<ul>
<li>如果没有，则设置标志的CLONE_PTRACE位<br/>
</li>
</ul>

</li>
</ul>

</li>
</ul>


<p><br/>
<pre class="src src-c"><span class="linenr">1:  </span><span style="color: #a020f0;">if</span> (unlikely(current-&gt;ptrace)) {
<span class="linenr">2:  </span>        trace = fork_traceflag (clone_flags);
<span class="linenr">3:  </span>        <span style="color: #a020f0;">if</span> (trace)
<span class="linenr">4:  </span>            clone_flags |= CLONE_PTRACE;
<span class="linenr">5:  </span>}
</pre>

</p><ul>
<li>用copy_process函数复制父进程的进程描述符，创建新的进程描述符。<br/>
<ol>
<li>分配失败则释放分配的进程ID并返回pid，此时pid为随机数<br/>
</li>
<li>否则：<br/>
<ul>
<li>检查参数flag中是否设置了CLONE_VFORK,如果有则初始化一个completion结构体，并将新建进程描述符的vfork_donw指针指向此结构体。<br/>
</li>
</ul>

</li>
</ol>

</li>
</ul>


<p><br/>
<pre class="src src-c"><span class="linenr">1:  </span><span style="color: #a020f0;">struct</span> <span style="color: #228b22;">completion</span> <span style="color: #a0522d;">vfork</span>;
<span class="linenr">2:  </span><span style="color: #a020f0;">if</span> (clone_flags &amp; CLONE_VFORK) {
<span class="linenr">3:  </span>    p-&gt;vfork_done = &amp;vfork;
<span class="linenr">4:  </span>    init_completion(&amp;vfork);
<span class="linenr">5:  </span>}
</pre>

         completion结构体如下：<br/>
</p>
<p><br/>
<pre class="src src-c"><span class="linenr">1:  </span><span style="color: #a020f0;">struct</span> <span style="color: #228b22;">completion</span> {
<span class="linenr">2:  </span>    <span style="color: #228b22;">unsigned</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">done</span>;
<span class="linenr">3:  </span>    <span style="color: #228b22;">wait_queue_head_t</span> <span style="color: #a0522d;">wait</span>;
<span class="linenr">4:  </span>};
</pre>

         task_struct-&gt;vfork_done是为vfork服务。<br/>
</p><ul>
<li>如果标志中的CLONE_STOPPED或父进程的ptrace被设置PT_TRACED，则给新建进程发送SIGSTOP信号<br/>
</li>
<li>如果CLONE_STOPPED没有被设置，则调用 wake_up_new_task 唤醒新建的进程。否则设置其状态为 TASK_STOPPED<br/>
</li>
<li>如果父进程被跟踪，则设置当前进程描述符的 <code>ptrace_message</code> 为新建进程的ID并调用 <code>ptrace_notify</code> 停止当前进程发送SIGCHLD信号通知调试进程当前进程创建了一个新的子进程，其进程ID可以在通过当前进程的 <code>ptrace_message</code> 来获得<br/>
</li>
<li>如果设置了 <code>CLONE_VFORK</code> 则等待子进程执行完毕（等待列表中可能有多个，需要调用 __wake_up_common来遍历唤醒<br/>
</li>
</ul>

</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> copy_process</h2>
<div class="outline-text-2" id="text-3">

<p>  利用旧进程描述符创建新进程描述符，但是并不在此函数内开始执行。<br/>
</p><ul>
<li>检查参数标志中是否有自相矛盾的地方，例如： CLONE_NEWNS和CLONE_FS同时设置，CLONE_THREAD设了但CLONE_SIGHAND没有设置，CLONE_SIGHAND设置了但CLONE_VM没有设置。<br/>
</li>
<li>通过调用 <code>security_task_create</code> 进行额外的安全检查<br/>
</li>
<li>高用 <code>dup_task_current</code> 进行复制<br/>
<ul>
<li>调用 <code>alloc_task_struct</code> 和 <code>alloc_thread_info</code> 分别分配进程描述符和thread_info并通过内部指针相连<br/>
</li>
</ul>

</li>
<li>检查是否资源越界<br/>
</li>
<li>一个用户对应一个用户结构，一个进程必属于某个用户，由 <code>task_struct-&gt;user</code> 指向的 <code>struct user</code> 来描述。<br/>
    增加新建进程对应用户的用户结构计数（__count表此结构被使用的计数）和进程计数（此用户拥有的进程数量）<br/>
</li>
<li>检查是否进程数量越界<br/>
</li>
<li>如果标志中有 <code>CLONE_PARENT_SETTID</code> 则将新建进程ID赋给参数中的 parent_tidptr<br/>
</li>
<li>设置新建进程的ID，标志，<br/>
</li>
<li>初始化兄弟和孩子域<br/>
</li>
<li>初始化锁 <code>alloc_lock</code> <code>proc_lock</code><br/>
</li>
<li>调用copy_semundo( ), copy_files( ) , copy_fs( ), copy_sighand( ), copy_signal( ), copy_mm( ), and copy_namespace( )根据父进程的相关域来初始化新建进程的域<br/>
</li>
<li>如果clone_flag中有 clone_chld_settid或clone_chld_cleartid被设置，则设置新建进程的set_child_tid和clear_child_tid为参数中的child_tidptr(表新建进程的id)<br/>
</li>
<li>调用 <code>sched_fork</code> 完成调度器数据结构的初始化工作<br/>
</li>
<li>如果clone_flag中设置了clone_parent或clone_thread则设置新建进程的real_parent和parent为当前进程的real_parent，否则设置real_parent为当前进程<br/>
</li>
<li><code>SET_LINKS</code> 将新建进程加到进程链表中<br/>
</li>
<li>调用 <code>attach_pid</code> 将新建进程加到pidhash[PIDTYPE_PID]中<br/>
<ul>
<li>如果新建进程是线程组leader（没有设置CLONE_THREAD)则初始化tgid为自身pid，group_leader为自身<br/>
      调用attach_pid插入到其它3个pidhash中<br/>
</li>
<li>否则如果CLONE_THREAD被设置了（表明新建进程与父进程是同一线程组），则设置tgid为父进程的tgid，设置group_leader为父进程的group_leader.<br/>
</li>
</ul>

</li>
<li>增加nr_threads变量和total_forks变量<br/>
</li>
<li>返回新建进程描述符指针<br/>
</li>
</ul>

</div>
</div>
</div>

</body>
</html>
